import pywikibot

ALEPHBET = ('א', 'ב', 'ג', 'ד', 'ה', 'ו', 'ז', 'ח', 'ט',
'י', 'יא', 'יב', 'יג', 'יד', 'טו', 'טז', 'יז', 'יח', 'יט',
'כ', 'כא', 'כב', 'כג', 'כד', 'כה', 'כו', 'כז', 'כח', 'כט',
'ל', 'לא', 'לב', 'לג', 'לד', 'לה', 'לו', 'לז', 'לח', 'לט',
'מ', 'מא', 'מב', 'מג', 'מד', 'מה', 'מו', 'מז', 'מח', 'מט',
'נ', 'נא', 'נב', 'נג', 'נד', 'נה', 'נו', 'נז', 'נח', 'נט',
'ס', 'סא', 'סב', 'סג', 'סד', 'סה', 'סו', 'סז', 'סח', 'סט',
'ע', 'עא', 'עב', 'עג', 'עד', 'עה', 'עו', 'עז', 'עח', 'עט',
'פ', 'פא', 'פב', 'פג', 'פד', 'פה', 'פו', 'פז', 'פח', 'פט')

data = {
"ברכות": {"א": ['א', 'א', 'ז', 'א'], "ב": ['ז', 'א', 'י', 'א'], "ג": ['י', 'א', 'יז', 'ב'], "ד": ['יח', 'א', 'כא', 'א'], "ה": ['כא', 'א', 'כד', 'ב'], "ו": ['כד', 'ב', 'לב', 'ב'], "ז": ['לב', 'ב', 'לח', 'א'], "ח": ['לח', 'א', 'מב', 'ב'], "ט": ['מב', 'ב', 'מה', 'א']},
"שבת": {"א": ['א', 'א', 'ח', 'ב'], "ב": ['ח', 'ב', 'יד', 'ב'], "ג": ['טו', 'א', 'כא', 'ב'], "ד": ['כא', 'ב', 'כג', 'ב'], "ה": ['כד', 'א', 'כה', 'ב'], "ו": ['כה', 'ב', 'ל', 'ב'], "ז": ['לא', 'א', 'לג', 'א'], "ח": ['לג', 'א', 'לג', 'ב'], "ט": ['לג', 'ב', 'לה', 'א'], "י": ['לה', 'א', 'לו', 'א'], "יא": ['לו', 'א', 'לז', 'א'], "יב": ['לז', 'א', 'לז', 'ב'], "יג": ['לז', 'ב', 'לח', 'ב'], "יד": ['לח', 'ב', 'מא', 'א'], "טו": ['מא', 'א', 'מב', 'ב'], "טז": ['מב', 'ב', 'מז', 'א'], "יז": ['מז', 'א', 'מט', 'ב'], "יח": ['נ', 'א', 'נב', 'א'], "יט": ['נב', 'א', 'נו', 'א'], "כ": ['נו', 'א', 'נט', 'א'], "כא": ['נט', 'א', 'ס', 'א'], "כב": ['ס', 'א', 'סג', 'א'], "כג": ['סג', 'א', 'סה', 'ב'], "כד": ['סה', 'ב', 'סח', 'א']},
"עירובין": {"א": ['א', 'א', 'ה', 'א'], "ב": ['ה', 'ב', 'ז', 'א'], "ג": ['ז', 'א', 'י', 'ב'], "ד": ['י', 'ב', 'טו', 'ב'], "ה": ['טו', 'ב', 'יט', 'א'], "ו": ['יט', 'א', 'כד', 'א'], "ז": ['כד', 'א', 'כו', 'ב'], "ח": ['כז', 'א', 'כט', 'ב'], "ט": ['ל', 'א', 'לא', 'א'], "י": ['לא', 'א', 'לה', 'ב']},
"פסחים": {"א": ['א', 'א', 'ה', 'ב'], "ב": ['ה', 'ב', 'יב', 'ב'], "ג": ['יג', 'א', 'טז', 'ב'], "ד": ['טז', 'ב', 'יח', 'ב'], "ה": None, "ו": None, "ז": None, "ח": None, "ט": None, "י": ['יט', 'א', 'כח', 'א']},
"יומא": {"א": None, "ב": None, "ג": None, "ד": None, "ה": None, "ו": None, "ז": None, "ח": ['א', 'א', 'ו', 'ב']},
"סוכה": {"א": ['א', 'א', 'ט', 'ב'], "ב": ['ט', 'ב', 'יג', 'ב'], "ג": ['יג', 'ב', 'כ', 'ב'], "ד": ['כא', 'א', 'כג', 'א'], "ה": None},
"ביצה": {"א": ['א', 'א', 'ח', 'א'], "ב": ['ח', 'א', 'יב', 'ב'], "ג": ['יב', 'ב', 'טז', 'א'], "ד": ['טז', 'א', 'יט', 'ב'], "ה": ['יט', 'ב', 'כב', 'א']},
"ראש השנה": {"א": ['א', 'א', 'ה', 'ב'], "ב": None, "ג": ['ה', 'ב', 'ח', 'א'], "ד": ['ח', 'א', 'יב', 'ב']},
"תענית": {"א": ['א', 'א', 'ה', 'ב'], "ב": ['ה', 'ב', 'ז', 'ב'], "ג": ['ז', 'ב', 'ט', 'א'], "ד": ['ט', 'א', 'י', 'ב']},
"מגילה": {"א": ['א', 'א', 'ד', 'ב'], "ב": ['ד', 'ב', 'ז', 'א'], "ג": ['ז', 'א', 'יא', 'ב'], "ד": ['יא', 'ב', 'טז', 'ב']},
"מועד קטן": {"א": ['א', 'א', 'ה', 'א'], "ב": ['ה', 'א', 'ז', 'א'], "ג": ['ז', 'א', 'יח', 'ב']},
"יבמות": {"א": ['א', 'א', 'ג', 'ב'], "ב": ['ג', 'ב', 'ז', 'ב'], "ג": ['ז', 'ב', 'י', 'ב'], "ד": ['י', 'ב', 'יז', 'א'], "ה": ['יז', 'א', 'יח', 'א'], "ו": ['יח', 'א', 'כא', 'ב'], "ז": ['כא', 'ב', 'כד', 'א'], "ח": ['כד', 'א', 'כו', 'ב'], "ט": ['כו', 'ב', 'כח', 'ב'], "י": ['כח', 'ב', 'לא', 'א'], "יא": ['לא', 'א', 'לב', 'א'], "יב": ['לב', 'א', 'לה', 'ב'], "יג": ['לה', 'ב', 'מא', 'א'], "יד": ['מא', 'א', 'מב', 'א'], "טו": ['מב', 'א', 'מד', 'ב'], "טז": ['מד', 'ב', 'מז', 'א']},
"כתובות": {"א": ['א', 'א', 'ה', 'א'], "ב": ['ה', 'א', 'יג', 'א'], "ג": ['יג', 'א', 'יד', 'ב'], "ד": ['טו', 'א', 'כא', 'א'], "ה": ['כא', 'א', 'כח', 'ב'], "ו": ['כח', 'ב', 'לא', 'א'], "ז": ['לא', 'ב', 'לו', 'ב'], "ח": ['לו', 'ב', 'מא', 'א'], "ט": ['מא', 'א', 'מח', 'א'], "י": ['מח', 'א', 'נה', 'א'], "יא": ['נה', 'א', 'ס', 'ב'], "יב": ['ס', 'ב', 'סב', 'א'], "יג": ['סב', 'א', 'סה', 'ב']},
"נדרים": {"א": ['א', 'א', 'ג', 'א'], "ב": ['ג', 'ב', 'ו', 'א'], "ג": ['ו', 'א', 'י', 'ב'], "ד": ['י', 'ב', 'יד', 'א'], "ה": ['יד', 'א', 'טו', 'ב'], "ו": ['טו', 'ב', 'יז', 'ב'], "ז": ['יז', 'ב', 'יט', 'ב'], "ח": ['יט', 'ב', 'כא', 'א'], "ט": ['כא', 'א', 'כב', 'ב'], "י": ['כג', 'א', 'כה', 'א'], "יא": ['כה', 'א', 'כח', 'א']},
"גיטין": {"א": ['א', 'א', 'ז', 'א'], "ב": ['ז', 'א', 'יב', 'א'], "ג": ['יב', 'א', 'טו', 'ב'], "ד": ['טז', 'א', 'כד', 'ב'], "ה": ['כד', 'ב', 'כח', 'א'], "ו": ['כח', 'א', 'לג', 'ב'], "ז": ['לג', 'ב', 'לט', 'ב'], "ח": ['לט', 'ב', 'מב', 'ב'], "ט": ['מג', 'א', 'נא', 'א']},
"קידושין": {"א": ['א', 'א', 'טז', 'א'], "ב": ['טז', 'א', 'כג', 'א'], "ג": ['כג', 'א', 'ל', 'א'], "ד": ['ל', 'א', 'לג', 'ב']},
"בבא קמא": {"א": ['א', 'א', 'ו', 'ב'], "ב": ['ז', 'א', 'יב', 'א'], "ג": ['יב', 'א', 'יז', 'א'], "ד": ['יז', 'ב', 'כ', 'א'], "ה": ['כ', 'א', 'כג', 'ב'], "ו": ['כג', 'ב', 'כו', 'ב'], "ז": ['כו', 'ב', 'ל', 'א'], "ח": ['ל', 'א', 'לג', 'א'], "ט": ['לג', 'א', 'לח', 'א'], "י": ['לח', 'א', 'מו', 'ב']},
"בבא מציעא": {"א": ['א', 'א', 'יב', 'א'], "ב": ['יב', 'א', 'יח', 'א'], "ג": ['יח', 'א', 'כה', 'ב'], "ד": ['כה', 'ב', 'לג', 'ב'], "ה": ['לג', 'ב', 'מה', 'ב'], "ו": ['מה', 'ב', 'נא', 'ב'], "ז": ['נא', 'ב', 'נד', 'ב'], "ח": ['נד', 'ב', 'ס', 'א'], "ט": ['ס', 'ב', 'ע', 'ב'], "י": ['ע', 'ב', 'עג', 'א']},
"בבא בתרא": {"א": ['א', 'א', 'ט', 'א'], "ב": ['ט', 'א', 'יד', 'א'], "ג": ['יד', 'א', 'לג', 'א'], "ד": ['לג', 'א', 'לח', 'א'], "ה": ['לח', 'ב', 'מו', 'א'], "ו": ['מו', 'א', 'מט', 'ב'], "ז": ['מט', 'ב', 'נא', 'ב'], "ח": ['נא', 'ב', 'סה', 'א'], "ט": ['סה', 'א', 'עה', 'א'], "י": ['עה', 'א', 'פג', 'א']},
"סנהדרין": {"א": ['א', 'א', 'ג', 'א'], "ב": None, "ג": ['ג', 'ב', 'י', 'א'], "ד": ['י', 'א', 'יג', 'ב'], "ה": ['יד', 'א', 'יד', 'א'], "ו": ['יד', 'ב', 'טו', 'ב'], "ז": ['טו', 'ב', 'טז', 'ב'], "ח": ['יז', 'א', 'יח', 'ב'], "ט": ['יח', 'ב', 'יט', 'א'], "י": ['יט', 'א', 'יט', 'א'], "יא": ['יט', 'ב', 'כ', 'א']},
"מכות": {"א": ['א', 'א', 'ג', 'א'], "ב": ['ג', 'א', 'ג', 'ב'], "ג": ['ג', 'ב', 'ד', 'ב']},
"שבועות": {"א": ['א', 'א', 'א', 'ב'], "ב": ['א', 'ב', 'ז', 'א'], "ג": ['ז', 'א', 'יג', 'א'], "ד": ['יג', 'א', 'טז', 'ב'], "ה": ['טז', 'ב', 'יז', 'א'], "ו": ['יז', 'ב', 'כה', 'א'], "ז": ['כה', 'ב', 'לג', 'ב'], "ח": ['לג', 'ב', 'לג', 'ב']},
"עבודה זרה": {"א": ['א', 'א', 'ז', 'א'], "ב": ['ז', 'א', 'יז', 'ב'], "ג": ['יז', 'ב', 'כג', 'א'], "ד": ['כג', 'א', 'ל', 'א'], "ה": ['ל', 'א', 'מ', 'א']},
"חולין": {"א": ['א', 'א', 'ה', 'ב'], "ב": ['ה', 'ב', 'ח', 'ב'], "ג": ['ח', 'ב', 'כד', 'א'], "ד": ['כד', 'א', 'כז', 'א'], "ה": ['כז', 'א', 'כח', 'א'], "ו": ['כח', 'ב', 'כט', 'ב'], "ז": ['ל', 'א', 'לו', 'ב'], "ח": ['לו', 'ב', 'מד', 'ב'], "ט": None, "י": ['מד', 'ב', 'מו', 'ב'], "יא": ['מו', 'ב', 'מז', 'ב'], "יב": ['מז', 'ב', 'מח', 'ב']}
}

site = pywikibot.Site('he', 'wikisource')

for masechet in data:
	prev_last_daf = ['', '']
	for perek in data[masechet]:
		if data[masechet][perek] is None:
			continue
		first_daf = data[masechet][perek][:2]
		last_daf = data[masechet][perek][2:]
		daf = first_daf
		while ALEPHBET.index(daf[0]) <= ALEPHBET.index(last_daf[0]):
			page = pywikibot.Page(site, f'רי"ף על הש"ס/{masechet}/דף {daf[0]} עמוד {daf[1]}')
			if daf == prev_last_daf:
				page.text = page.text.replace('|%s|%s}}' % (daf[0], daf[1]), '|%s|%s|שני פרקים=כן}}' % (daf[0], daf[1]))
			else:
				if page.exists():
					shiluv = '\n{{דרוש שילוב}}\n'
				else:
					shiluv = ''
				if '{{דף של רי"ף' not in page.text and not (daf[0] == last_daf[0] and daf[1] == 'ב' and last_daf[1] == 'א'):
					page.text = '{{דף של רי"ף|%s|%s|%s}}' % (perek, daf[0], daf[1]) + shiluv + page.text
			page.save(summary='{{דף של רי"ף}}')
			print(page.text[:90])
			
			if daf[1] == 'א':
				daf = [daf[0], 'ב']
			else:
				daf = [ALEPHBET[ALEPHBET.index(daf[0])+1], 'א']
		
		prev_last_daf = last_daf
print('well done!!')