import pywikibot
import re

ALEPHBET = ['א', 'ב', 'ג', 'ד', 'ה', 'ו', 'ז', 'ח', 'ט',
'י', 'יא', 'יב', 'יג', 'יד', 'טו', 'טז', 'יז', 'יח', 'יט',
'כ', 'כא', 'כב', 'כג', 'כד', 'כה', 'כו', 'כז', 'כח', 'כט',
'ל', 'לא', 'לב', 'לג', 'לד', 'לה', 'לו', 'לז', 'לח', 'לט',
'מ', 'מא', 'מב', 'מג', 'מד', 'מה', 'מו', 'מז', 'מח', 'מט',
'נ', 'נא', 'נב', 'נג', 'נד', 'נה', 'נו', 'נז', 'נח', 'נט',
'ס', 'סא', 'סב', 'סג', 'סד', 'סה', 'סו', 'סז', 'סח', 'סט',
'ע', 'עא', 'עב', 'עג', 'עד', 'עה', 'עו', 'עז', 'עח', 'עט',
'פ', 'פא', 'פב', 'פג', 'פד', 'פה', 'פו', 'פז', 'פח', 'פט',
'צ', 'צא', 'צב', 'צג', 'צד', 'צה', 'צו', 'צז', 'צח', 'צט',
'ק', 'קא', 'קב', 'קג', 'קד', 'קה', 'קו', 'קז', 'קח', 'קט',
'קי', 'קיא', 'קיב', 'קיג', 'קיד', 'קטו', 'קטז', 'קיז', 'קיח', 'קיט',
'קכ', 'קכא', 'קכב', 'קכג', 'קכד', 'קכה', 'קכו', 'קכז', 'קכח', 'קכט',
'קל', 'קלא', 'קלב', 'קלג', 'קלד', 'קלה', 'קלו', 'קלז', 'קלח', 'קלט',
'קמ', 'קמא', 'קמב', 'קמג', 'קמד', 'קמה', 'קמו', 'קמז', 'קמח', 'קמט',
'קנ', 'קנא', 'קנב', 'קנג', 'קנד', 'קנה', 'קנו', 'קנז', 'קנח', 'קנט',
'קס', 'קסא', 'קסב', 'קסג', 'קסד', 'קסה', 'קסו', 'קסז', 'קסח', 'קסט',
'קע', 'קעא', 'קעב', 'קעג', 'קעד', 'קעה', 'קעו', 'קעז', 'קעח', 'קעט',
'קפ', 'קפא', 'קפב', 'קפג', 'קפד', 'קפה', 'קפו', 'קפז', 'קפח', 'קפט',
'קצ', 'קצא', 'קצב', 'קצג', 'קצד', 'קצה', 'קצו', 'קצז', 'קצח', 'קצט',
'ר', 'רא', 'רב', 'רג', 'רד', 'רה', 'רו', 'רז', 'רח', 'רט',
'רי', 'ריא', 'ריב', 'ריג', 'ריד', 'רטו', 'רטז', 'ריז', 'ריח', 'ריט',
'רכ', 'רכא', 'רכב', 'רכג', 'רכד', 'רכה', 'רכו', 'רכז', 'רכח', 'רכט',
'רל', 'רלא', 'רלב', 'רלג', 'רלד', 'רלה', 'רלו', 'רלז', 'רלח', 'רלט',
'רמ', 'רמא', 'רמב', 'רמג', 'רמד', 'רמה', 'רמו', 'רמז', 'רמח', 'רמט',
'רנ', 'רנא', 'רנב', 'רנג', 'רנד', 'רנה', 'רנו', 'רנז', 'רנח', 'רנט',
'רס', 'רסא', 'רסב', 'רסג', 'רסד', 'רסה', 'רסו', 'רסז', 'רסח', 'רסט',
'רע', 'רעא', 'רעב', 'רעג', 'רעד', 'רעה', 'רעו', 'רעז', 'רעח', 'רעט',
'רפ', 'רפא', 'רפב', 'רפג', 'רפד', 'רפה', 'רפו', 'רפז', 'רפח', 'רפט',
'רצ', 'רצא', 'רצב', 'רצג', 'רצד', 'רצה', 'רצו', 'רצז', 'רצח', 'רצט',
'ש', 'שא', 'שב', 'שג', 'שד', 'שה', 'שו', 'שז', 'שח', 'שט',
'שי', 'שיא', 'שיב', 'שיג', 'שיד', 'שטו', 'שטז', 'שיז', 'שיח', 'שיט',
'שכ', 'שכא', 'שכב', 'שכג', 'שכד', 'שכה', 'שכו', 'שכז', 'שכח', 'שכט',
'של', 'שלא', 'שלב', 'שלג', 'שלד', 'שלה', 'שלו', 'שלז', 'שלח', 'שלט',
'שמ', 'שמא', 'שמב', 'שמג', 'שמד', 'שמה', 'שמו', 'שמז', 'שמח', 'שמט',
'שנ', 'שנא', 'שנב', 'שנג', 'שנד', 'שנה', 'שנו', 'שנז', 'שנח', 'שנט',
'שס', 'שסא', 'שסב', 'שסג', 'שסד', 'שסה', 'שסו', 'שסז', 'שסח', 'שסט',
'שע', 'שעא', 'שעב', 'שעג', 'שעד', 'שעה', 'שעו', 'שעז', 'שעח', 'שעט',
'שפ', 'שפא', 'שפב', 'שפג', 'שפד', 'שפה', 'שפו', 'שפז', 'שפח', 'שפט',
'שצ', 'שצא', 'שצב', 'שצג', 'שצד', 'שצה', 'שצו', 'שצז', 'שצח', 'שצט',
'ת', 'תא', 'תב', 'תג', 'תד', 'תה', 'תו', 'תז', 'תח', 'תט',
'תי', 'תיא', 'תיב', 'תיג', 'תיד', 'תטו', 'תטז', 'תיז', 'תיח', 'תיט',
'תכ', 'תכא', 'תכב', 'תכג', 'תכד', 'תכה', 'תכו', 'תכז', 'תכח', 'תכט',
'תל', 'תלא', 'תלב', 'תלג', 'תלד', 'תלה', 'תלו', 'תלז', 'תלח', 'תלט',
'תמ', 'תמא', 'תמב', 'תמג', 'תמד', 'תמה', 'תמו', 'תמז', 'תמח', 'תמט',
'תנ', 'תנא', 'תנב', 'תנג', 'תנד', 'תנה', 'תנו', 'תנז', 'תנח', 'תנט',
'תס', 'תסא', 'תסב', 'תסג', 'תסד', 'תסה', 'תסו', 'תסז', 'תסח', 'תסט',
'תע', 'תעא', 'תעב', 'תעג', 'תעד', 'תעה', 'תעו', 'תעז', 'תעח', 'תעט',
'תפ', 'תפא', 'תפב', 'תפג', 'תפד', 'תפה', 'תפו', 'תפז', 'תפח', 'תפט',
'תצ', 'תצא', 'תצב', 'תצג', 'תצד', 'תצה', 'תצו', 'תצז', 'תצח', 'תצט']

site = pywikibot.Site('he', 'wikisource')
mainpage = pywikibot.Page(site, 'ספר הפליאה')
pages = re.findall('# ?\[\[(.*?)\|.*?\]\]', mainpage.text)
fixed_pages = [re.sub('# ?\[\[(.*?)\|.*?\]\]', '\\1', x) for x in pages]

counter = 0
for x in fixed_pages:
	page = pywikibot.Page(site, x)
	if page.isRedirectPage():
		counter += 1
		continue
	new_title = 'ספר הפליאה/%s' % ALEPHBET[counter]
	pywikibot.output('Moving page {} to [[{}]]'.format(page, new_title))
	if '{{ספר הפליאה' in page.text:
		page.text = re.sub('(\{\{ספר הפליאה)\|.*?|.*?\}\}\n', '\\1}}\n==%s==' % x[13:], page.text)
	else:
		page.text = '{{ספר הפליאה}}\n\n==%s==\n' % x[13:] + page.text
	page.save()
	page.move(new_title, reason='התאמה לפורמט דפי משנה')
	counter += 1