import pywikibot
import re
from pywikibot.pagegenerators import (PrefixingPageGenerator, AllpagesPageGenerator)

site = pywikibot.Site()
#edit_page = pywikibot.Page(site, 'משתמש:Shalomori123/קישורים לבוט')
edit_page = pywikibot.Page(site,'משתמש:Shalomori123/טיוטה')
counter = 0

mefarshim = ['מסורה קטנה', 'תרגום שני', 'מסורה גדולה', 'רש"י', 'מיוחס לרש"י', 'שפ"ח', 'רשב"ם', 'אבן עזרא', 'תשובות דונש בן לברט לרב סעדיה גאון', 'שפת יתר', 'רד"ק', 'רמב"ן', 'רבינו בחיי', 'רלב"ג', 'ספורנו', 'חזקוני', 'בכור שור', 'רבנו יונה', 'אברבנאל', 'רבי ישעיה די טראני', 'מלבי"ם', 'אלשיך', 'חיד"א', 'כלי יקר', 'אור החיים', 'הגאון מווילנה', 'רבי יוסף אבן כספי', 'רבי יוסף קרא', 'מגילת סתרים', 'מצודות', 'מצודת ציון', 'מצודת דוד', 'העמק דבר', 'משה דוד ואלי', 'תו"א', 'תולדות אהרן', 'מכילתא', 'ספרא', 'ספרי', 'התורה והמצוה', 'ילקוט שמעוני', 'מנחת שי', 'בעל הטורים', 'נחמיאש']

for page in AllpagesPageGenerator(namespace=100):
	if not any([re.fullmatch('קטע:' + mefaresh + ' על (בראשית|שמות|ויקרא|במדבר|דברים|יהושע|שופטים|שמואל א|שמואל ב|מלכים א|מלכים ב|ישעיהו|ירמיהו|יחזקאל|תרי עשר|הושע|יואל|עמוס|עובדיה|יונה|מיכה|נחום|חבקוק|צפניה|חגי|זכריה|מלאכי|תהלים|משלי|איוב|שיר השירים|רות|אסתר|קהלת|איכה|דניאל|עזרא|נחמיה|דברי הימים א|דברי הימים ב|ישעיה|ירמיה|תהילים)( ק?[ט-צ]?[א-י]?){2}', page.title()) for mefaresh in mefarshim]):
		edit_page.text += ' |\n' + str(page)
		print(page, 'added')
		counter += 1
		if not counter % 100:
			edit_page.save(summary='‏דפים שאינם מפרש על פסוק במרחב קטע')
edit_page.save(summary='‏דפים שאינם מפרש על פסוק במרחב קטע')
print('mission comleted!')