import re
import pywikibot

taz_oh = ['', 'א', 'ב', 'ג', 'ד', 'ו', 'ז',
'ח', 'ט', 'י', 'יא', 'יב', 'יג', 'יד', 'טו', 'טז', 'יז', 'יח', 'יט', 'כ', 'כא', 'כב',
'כה', 'כז', 'כט', 'ל', 'לא', 'לב', 'לג', 'לד', 'לו', 'לח', 'לט', 'מ', 'מא', 'מב', 'מג', 'מד', 'מה',
'מו', 'מז', 'נא', 'נב', 'נג', 'נד', 'נה', 'נו',
'נח', 'נט', 'ס', 'סא', 'סב', 'סג', 'סד', 'סה', 'סו', 'סז', 'סט', 'ע', 'עא', 'עב', 'עד', 'עה', 'עו', 'עט', 'פ', 'פא', 'פב', 'פג', 'פד', 'פה', 'פז', 'פח',
'פט', 'צ', 'צא', 'צב', 'צד', 'צה', 'צו', 'צז', 'צח', 'צט', 'ק', 'קא', 'קב', 'קד', 'קו', 'קז', 'קח', 'קט', 'קי', 'קיא', 'קיג', 'קיד', 'קטו', 'קטז', 'קיז', 'קיח', 'קיט', 'קכ', 'קכב', 'קכג', 'קכד', 'קכה', 'קכו', 'קכז',
'קכח', 'קל', 'קלא', 'קלב', 'קלד', 'קלה',
'קלז', 'קלח', 'קלט', 'קמ', 'קמא', 'קמג', 'קמד', 'קמו', 'קמז', 'קמט',
'קנ', 'קנא', 'קנב', 'קנג', 'קנד', 'קנה',
'קנח', 'קנט', 'קס', 'קסא', 'קסב', 'קסד', 'קסה',
'קסו', 'קסז', 'קסח', 'קסט', 'קע', 'קעא', 'קעב', 'קעד', 'קעה', 'קעו', 'קעז', 'קעח', 'קעט', 'קפ', 'קפא', 'קפב', 'קפג', 'קפד', 'קפה', 'קפו', 'קפח', 'קפט', 'קצ', 'קצא', 'קצב', 'קצג', 'קצה', 'קצו', 'קצז', 'קצח', 'קצט', 'ר',
'רב', 'רג', 'רד', 'רה', 'רו', 'רז', 'רח', 'רט', 'רי', 'ריא', 'ריב', 'ריג', 'ריד',
'רטו', 'רטז', 'ריז', 'ריח', 'ריט', 'רכא', 'רכג', 'רכד', 'רכה', 'רכז', 'רכט', 'רל', 'רלב', 'רלג', 'רלד', 'רלה', 'רלו', 'רמ',
'רמב', 'רמג', 'רמד', 'רמה', 'רמו', 'רמז', 'רמח', 'רמט', 'רנ', 'רנא', 'רנב', 'רנג', 'רנד', 'רנה', 'רנז', 'רנח', 'רנט', 'רס', 'רסא', 'רסב', 'רסג', 'רסד', 'רסה', 'רסו', 'רסז', 'רסח', 'רסט', 'ער', 'רעא', 'ערב', 'רעג', 'רעד', 'ערה', 'רעו', 'רעז', 'רעח', 'רעט', 'רפ', 'רפב', 'רפג', 'רפד', 'רפה', 'רפו', 'רפז', 'רפח', 'רפט', 'רצא', 'רצב', 'רצד', 'רצה', 'רצו', 'רצז', 'רצח', 'רצט', 'ש', 'שא', 'שב', 'שג', 'דש', 'שה', 'שו', 'שז', 'שח', 'שט', 'שי', 'שיא', 'שיב', 'שיג', 'שיד', 'שטו', 'שטז', 'שיז', 'שיח', 'שיט', 'שכ', 'שכא', 'שכב', 'שכג', 'שכד', 'שכה', 'שכו', 'שכז', 'שכח', 'של', 'שלא', 'שלב', 'שלג', 'שלד', 'שלה', 'שלו', 'שלז', 'שלח', 'שלט', 'שמ', 'שמב', 'שמג', 'שדמ',
'שמה', 'שמו', 'שמז', 'שמט', 'שנ', 'שנא', 'שנב', 'שנג', 'שנד', 'שנה', 'שנו', 'שנז', 'שנח', 'שס', 'שסא', 'שסב', 'שסג', 'שסד', 'שסה', 'שסו', 'שסז', 'שסח', 'שסט', 'שע', 'שעא', 'שעב', 'שעג', 'שעד', 'שעה', 'שעו', 'שעז', 'שעח', 'שפ', 'שפא', 'שפב', 'שפג', 'שפד', 'שפה', 'שפז', 'שפח', 'שצ', 'שצא', 'שצב', 'שצג', 'שצד', 'שצה',
'שצו', 'שצז', 'שצט', 'תא', 'תב', 'תג', 'תד', 'תה',
'תט', 'תיא', 'תיג', 'תטז',
'תיז', 'תיח', 'תיט', 'תכ', 'תכב', 'תכג', 'תכה', 'תכו', 'תכז', 'תכח',
'תכט', 'תל', 'תלא', 'תלב', 'תלג', 'תלד', 'תלה', 'תלו', 'תלז', 'תלח', 'תלט', 'תמ', 'תמא', 'תמב', 'תמג', 'תמד', 'תמה', 'תמו', 'תמז', 'תמח', 'תמט', 'תנ', 'תנא', 'תנב', 'תנג', 'תנד', 'תנה', 'תנו', 'תנז', 'תנח', 'תנט', 'תס', 'תסא', 'תסב', 'תסג', 'תסד', 'תסה', 'תסו', 'תסז', 'תסח', 'תסט', 'תעא', 'תעב', 'תעג', 'תעד', 'תעה', 'תעו', 'תעז', 'תעח', 'תעט', 'תפ', 'תפא', 'תפב', 'תפד', 'תפה', 'תפו', 'תפז', 'תפח', 'תפט', 'תצ', 'תצא', 'תצב', 'תצג', 'תצד',
'תצה', 'תצו', 'תצז', 'תצח', 'תצט', 'תק', 'תקא', 'תקב', 'תקג', 'תקד', 'תקה', 'תקו', 'תקז', 'תקח', 'תקט', 'תקי', 'תקיא', 'תקיב', 'תקיג', 'תקיד', 'תקטו', 'תקטז', 'תקיז', 'תקיח', 'תקיט', 'תקכא', 'תקכב', 'תקכד', 'תקכה', 'תקכו', 'תקכז', 'תקכח',
'תקלא', 'תקלב', 'תקלג', 'תקלד', 'תקלו', 'תקלז', 'תקלח', 'תקלט', 'תקמ', 'תקמא', 'תקמב', 'תקמג', 'תקמד', 'תקמה', 'תקמו', 'תקמז', 'תקמח',
'תקמט', 'תקנ', 'תקנא', 'תקנב', 'תקנג', 'תקנד', 'תקנה', 'תקנו', 'תקנז', 'תקנח', 'תקנט', 'תקס', 'תקסא',
'תקסב', 'תקסג', 'תקסד', 'תקסה', 'תקסו', 'תקסז', 'תקסח', 'תקסט', 'תקע', 'תקעא', 'תקעג', 'תקעד', 'תקעה', 'תקפ',
'תקפא', 'תקפב', 'תקפג', 'תקפד', 'תקפה', 'תקפו', 'תקפז', 'תקפח', 'תקפט', 'תקצ', 'תקצא', 'תקצב', 'תקצג', 'תקצד', 'תקצה', 'תקצו', 'תקצז', 'תקצח', 'תקצט', 'תר', 'תרב',
'תרד', 'תרה', 'תרו', 'תרז', 'תרח', 'תרי', 'תריא', 'תריב', 'תריג', 'תריד', 'תרטו', 'תרטז', 'תריח', 'תריט', 'תרכא', 'תרכב', 'תרכג', 'תרכד',
'תרכה', 'תרכו', 'תרכז', 'תרכח', 'תרכט', 'תרל', 'תרלא', 'תרלב', 'תרלג', 'תרלד', 'תרלה', 'תרלו', 'תרלז', 'תרלח', 'תרלט', 'תרמ', 'תרמא', 'תרמג',
'תרמה', 'תרמו', 'תרמז', 'תרמח', 'תרמט', 'תרנ', 'תרנא', 'תרנב', 'תרנג', 'תרנד', 'תרנה', 'תרנו', 'תרנז', 'תרנח', 'תרס', 'תרסא', 'תרסב', 'תרסד', 'תרסה', 'תרסו', 'תרסז', 'תרסח',
'תרע', 'תרעא', 'תרעב', 'תרעג', 'תרעד', 'תרעה', 'תרעו', 'תרעז', 'תרעח', 'תרעט', 'תרפא', 'תרפב', 'תרפג', 'תרפד', 'תרפה',
'תרפו', 'תרפז', 'תרפח', 'תרפט', 'תרצ', 'תרצא', 'תרצב', 'תרצג', 'תרצד', 'תרצה', 'תרצו', 'תרצז', '']

site = pywikibot.Site()
for i,siman in enumerate(taz_oh):
	if not siman:
		continue
	page = pywikibot.Page(site, 'ט"ז על אורח חיים '+siman)
	temp = '{{פרשן על שו"ע|ט"ז|אורח חיים|'+taz_oh[i-1]+'|'+siman+'|'+taz_oh[i+1]+'}}'
	page.text = re.sub('^\[\[ט"ז על אורח חיים\]\]', temp, page.text)
	page.save('{{פרשן על שו"ע}}')
print('done!')